Repository: themorlan/openREM
Catalog: openrem/locale/*/LC_MESSAGES/django.po
Languages: de, es_mx, it, pt_br

source: Writing study {row} of {numrows} to All data sheet and individual protocol sheets
de: Schreiben von Studien-{row} von {numrows} in das Tabellenblatt All data und in die einzelnen Protokollblätter
es_mx: Escritura del estudio {row} de {numrows} en Todas las hojas de datos y en las de protocolos individuales
it: Scrittura dello studio {row} di {numrows} sulla scheda "All data" sulle singole schede di protocollo

source: Checking to see if any response studies are already in the OpenREM database
de: Überprüfung ob bereits Studien in der OpenREM Datenbank vorhanden sind
es_mx: Comprobando si ya hay alguna respuesta de estudios en la base de datos de OpenREM
it: Verifico se sono già presenti dati per gli studi nel database OpenREM

source: Filter at {level} level on {filter_name} that {filter_type} {filter_list}
de: Filterung über {level} Kriterium {filter_name} auf {filter_type} {filter_list}
es_mx: Filtrar en {level} nivel en {filter_name} ese {filter_type} {filter_list}
it: Filtrare al livello {level} su {filter_name} e su {filter_type} {filter_list}

source: Getting series and image level information and deleting series we can't use
de: Auslesen von Informationen auf Serien- und Bildebene und löschen von Serien die nicht verwendet werden können
es_mx: Obtener información a nivel de series e imágenes y eliminar las series que no podemos usar
it: Recupero informazioni al livello di serie e immagine ed elimino serie che non possiamo utilizzare
pt_br: Leitura de informações sobre série e nível de imagem e exclusão de séries que não podem ser usadas

source: Image level matching for this study is complete (there many be more)
de: Abgleich auf Bildebene ist für diese Studie abgeschlossen (es können noch mehr vorhanden sein)
es_mx: La coincidencia a nivel de imagen para este estudio esta completa (hay muchas más)
it: La corrispondenza a livello di immagine per questo studio è stata completata (ce ne saranno molti altri)
pt_br: A correspondência no nível da imagem está completa para este estudo (pode haver mais)

source: Image level matches are continuing.
de: Abgleich auf Bildebene wird fortgeführt.
es_mx: Continúan las coincidencias de nivel de imagen.
it: Le corrispondenze a livello di immagine continuano.
pt_br: As correspondências de nível de imagem continuam.

source: Connection timed out, was aborted or received invalid response
de: Verbindungsabbruch oder ungültige Rückantwort
es_mx: Se agoto el tiempo de espera para la conexión, se cancelo o recibió una respuesta no válida
it: Connessione scaduta, interrotta o risposta non valida
pt_br: A conexão expirou, foi abortada ou recebeu uma resposta inválida

source: Series level matching for this study is complete (there may be more)
de: Abgleich auf Serienebene ist für diese Studie abgeschlossen (es können noch mehr vorhanden sein)
es_mx: El emparejamiento a nivel de series para este estudio esta completo (puede haber más)
it: La corrispondenza a livello di immagine per questo studio è stata completata (ce ne saranno molti altri)

source: Series level matches are continuing.
de: Abgleich auf Serienebene wird fortgeführt.
es_mx: Los emparejamientos a nivel de series continúan.
it: Le corrispondenze al livello di serie continuano.

source: Study level matching for {modalities} is complete
de: Abgleich auf Studienebene für {modalities} ist abgeschlossen
es_mx: El emparejamiento a nivel de estudios para {modalities} esta completo
it: La corrispondenza al livello di studio per le {modalities} è completa

source: Matches are continuing for {modalities} studies
de: Abgleich wird für {modalities} Studien fortgeführt
es_mx: Se continúan los emparejamientos para los estudios {modalities}
it: Le corrispondenze continuano per gli studi {modalities}

source: Currently querying for {modality} studies…
de: Abfrage für {modality} Studien läuft…
es_mx: Actualmente solicitando estudios de {modality}…
it: Attualmente sono in corso ricerche per studi di {modality} …

source: Pruning study responses based on inc/exc options
de: Rückmeldungen zu Studien wird limiert basierend auf Einschluss/Ausschluss Optionen
es_mx: Podando los estudios basados en las opciones en inc/exc
it: Stò rimuovendo risposte di studi sulla base delle opzioni inc/exc

source: Querying at series level to get more details about studies
de: Abfrage auf Serienebene um mehr Details zu den Studien zu erhalten
es_mx: Consultando a nivel de series para obtener más detalles sobre los estudios
it: Interrogazione a livello di serie per ottenere maggiori dettagli sugli studi

source: Deleting studies we didn't ask for
de: Löschen von Studien, die nicht abgefragt wurden
es_mx: Borrando los estudios que no solicitamos
it: Eliminazione di studi che non avevamo richiesto
pt_br: Excluindo estudos que não pedimos

source: Pruning series responses
de: Limitieren von Serienrückmeldungen
es_mx: Podando las respuestas de las series
it: Rimozione delle risposte relative alle serie

source: Removing any responses that match data we already have in the database
de: Löschen von Rückmeldungen, deren Daten bereits in der Datenbank vorhanden sind
es_mx: Eliminar cualquier respuesta que coincida con los datos que ya tenemos en la base de datos
it: Rimozione di tutte le risposte che corrispondono ai dati già disponibili nel database
pt_br: Remover todas as respostas que correspondem aos dados que já temos no banco de dados

source: Query complete. Query took {time} and we are left with {studies_left} studies to move.<br>Of the original {studies_initial} study responses,
de: Abfrage komplett. Zeitdauer {time} und es bleiben {studies_left} Studien von den ursprünglichen {studies_initial} Studienrückmeldungen für den Transfer übrig,
es_mx: Consulta completada. La consulta tomó {time} y nos quedan {studies_left} estudios para mover.<br>De las respuestas originales del estudio {studies_initial},
it: Query completata. La query ha richiesto {time} e ci rimangono {studies_left} studi da spostare. <br> Delle {studies_initial} risposte originali dello studio,
pt_br: Consulta concluída. A consulta levou {time} e ficamos com {studies_left} estudos para mover. <br> Das {studies_initial} respostas originais do estudo,

source: only studies with description that include '{text}' removed {num} studies,
de: nur Studien bei denen '{text}' in der Beschreibung vorkommt wurden {num} gelöscht,
es_mx: solo estudios cuya descripción incluya '{text}' eliminaron {num} estudios,
it: solo gli studi con descrizione che includono '{text}' rimossi {num} studi,

source: studies with description that do not include '{text}' removed {num} studies,
de: von Studien, bei denen '{text}' nicht in der Beschreibung vorkommnt wurden {num} gelöscht,
es_mx: estudios cuya descripción no incluya '{text}' eliminaron {num} estudios,
it: studi con descrizione che non includono '{text}' eliminati {num} studi,

source: only studies with station names that include '{text}' removed {num} studies,
es_mx: solo estudios con nombre de estación que incluya '{text}' eliminaron {num} estudios,

source: studies with station names that do not include '{text}' removed {num} studies,
es_mx: estudios con nombre de estación que no incluyan '{text}' eliminaron {num} estudios,

source: Removing duplicates of previous objects removed {duplicates_removed} studies.
es_mx: La eliminación de duplicados de objetos anteriores elimino estudios de {duplicates_removed}.
pt_br: A remoção de duplicatas de objetos anteriores removeu {duplicates_removed} estudos.

source: Fluoroscopy
de: Durchleuchtung
es_mx: Fluoroscopía
it: Fluoroscopia
pt_br: Fluoroscopia

source: Mammography
de: Mammographie
es_mx: Mamografía
it: Mammografia
pt_br: Mamografia

source: Radiography
de: Radiographie
es_mx: Radiografía
it: Radiografia
pt_br: Radiografia

source: Imports
de: Importe
es_mx: Importaciones
it: Importazioni
pt_br: Importações

source: Import patient size info
de: Informationen zur Patientengröße importieren
es_mx: Importar información del tamaño del paciente
it: Importa le informazioni sulla taglia del paziente
pt_br: Importar informações sobre o tamanho do paciente

source: Previous patient size imports
de: Vorherige Importe der Patientengröße
es_mx: Importaciones de tamaños de pacientes anteriores
it: Importazioni della taglia del paziente precedente
pt_br: Importações de tamanho de paciente anterior

source: Query remote server
de: Serverabfrage
es_mx: Consultar a servidor remoto
it: Query server remoto
pt_br: Consultar servidor remoto

source: Exports
de: Exporte
es_mx: Exportaciones
it: Esportazioni
pt_br: Exportações

source: Config
de: Konfigurieren
es_mx: Configuración
it: Configurazione

source: User level config
de: Konfiguration auf Benutzerebene
es_mx: Configuración a nivel de usuario
it: Configurazione a livello utente
pt_br: Configuração de nível de usuário

source: Chart options
de: Graphikoptionen
es_mx: Opciones de gráfico
it: Opzioni del grafico
pt_br: Opções de gráfico

source: Switch charts off
de: Graphiken ausschalten
es_mx: Desactivar gráficos
it: Disattivare i grafici
pt_br: Desligue os gráficos

source: View display names & modality
de: Anzeige von Gerätenamen und Modalitäten
es_mx: Mostrar visualización de nombres & modalidad
it: Visualizza nomi visualizzati e modalità

source: View not-patient indicators
de: Nicht patientenbezogene Indikatoren anzeigen
es_mx: Ver indicadores de no pacientes
it: Visualizza gli indicatori non paziente
pt_br: Mostrar indicadores não relacionados ao paciente

source: Home page options
de: Optionen für die Startseite
es_mx: Opciones de la página de inicio
it: Opzioni della home page
pt_br: Opções da página inicial

source: System level settings
de: Einstellungen auf Systemebene
es_mx: Configuraciones a nivel de sistema
it: Impostazioni a livello di sistema
pt_br: Configurações de nível de sistema

source: Users
de: Benutzer
es_mx: Usuarios
it: Utenti
pt_br: Usuários

source: Display names & modality
de: Gerätenamen und Modalitäten
es_mx: Mostrar nombres & modalidades
it: Visualizza nomi visualizzati e modalità

source: DICOM object deletion
de: Löschen von DICOM Objekten
es_mx: Eliminación de objetos DICOM
it: Eliminazione dell'oggetto DICOM

source: DICOM networking
de: DICOM Netzwerk
es_mx: Redes DICOM
it: Rete DICOM

source: Patient ID
de: Patienten ID
es_mx: Identificación de paciente
it: ID paziente
pt_br: ID do paciente

source: Not-patient indicators
de: Indikatoren ohne Patientenbezug
es_mx: Indicadores de no pacientes
it: Indicatori non pazienti
pt_br: Indicadores não relacionados ao paciente

source: Skin dose map
de: Hautdosisverteilung
es_mx: Mapa de dosis en piel
it: Mappa della dose cutanea

source: Fluoro alert levels
de: Warnschwellen für die Durchleuchtung
es_mx: Alerta de niveles de Fluoroscopía
it: Livelli di allarme fluoro

source: Fluoro alert notification
de: Benachrichtigung für die Durchleuchtung
es_mx: Notificación de alerta de Fluoroscopía
it: Notifica di allarme Fluoro

source: Tasks
de: Aufgaben
es_mx: Tareas
it: Attività
pt_br: Tarefas

source: User
de: Nutzer
es_mx: Usuario
it: Utente
pt_br: Usuário

source: Change password
de: Passwort ändern
es_mx: Cambiar contraseña
it: Modificare la password
pt_br: Alterar a senha

source: Logout
de: Abmelden
es_mx: Cerrar sesión
it: Disconnettersi
pt_br: Sair

source: Login
de: Anmelden
es_mx: Iniciar sesión
it: Accesso
pt_br: Entrar

source: Docs
de: Dokumentation
es_mx: Documentos
it: Documenti
pt_br: Documentação

source: OpenREM documentation - opens in a new tab
de: OpenREM Dokumentation - öffnet sich in einem neuen Tab
es_mx: Documentación de OpenREM - se abre en una nueva pestaña
it: Documentazione OpenREM - viene aperta in una nuova scheda
pt_br: Documentação OpenREM - abre em uma nova guia

source: OpenREM Documentation (%(docsversion)s)
de: OpenREM Dokumentation (%(docsversion)s)
es_mx: Documentación de OpenREM (%(docsversion)s)
it: Documentazione OpenREM (%(docsversion)s)
pt_br: Documentação OpenREM (%(docsversion)s)

source: System name
es_mx: Nombre del sistema
it: Nome del sistema
pt_br: Nome do sistema

source: Total number of studies
de: Gesamtzahl der Studien
es_mx: Número total de estudios
it: Numero totale di studi
pt_br: Número total de estudos

source: Latest study
de: Neueste Studie
es_mx: Último estudio
it: Ultimo studio
pt_br: Último estudo

source: Number in last %(day_delta)s days
de: Anzahl in den letzten %(day_delta)s-Tagen
es_mx: Número en los últimos %(day_delta)s días
it: Numero negli ultimi %(day_delta)s giorni
pt_br: Número nos últimos %(day_delta)s dias

source: There are %(total_studies)s studies in this database. Page last refreshed on %(current_time)s
de: In dieser Datenbank sind %(total_studies)s Studien vorhanden. Die Seite wurde zuletzt um %(current_time)s aktualisiert
es_mx: Hay un total de %(total_studies)s estudios en esta base de datos. Página actualizada por última vez el %(current_time)s
it: Ci sono %(total_studies)s studi in questo database. Pagina aggiornata l'ultima volta il %(current_time)s
pt_br: Existem %(total_studies)s estudos neste banco de dados. Página atualizada pela última vez em %(current_time)s

source: Chart plotting on.
de: Diagrammanzeige ein.
es_mx: Trazado de gráficos activado.
it: Disegno su grafico acceso.
pt_br: A plotagem do gráfico está ativada.

source: Chart plotting off.
de: Diagrammanzeige aus.
es_mx: Trazado de gráficos desactivado.
it: Disegno su grafico spento.
pt_br: A plotagem do gráfico está desativada.

source: Please wait - querying the database
de: Bitte warten - die Datenbank wird abgefragt
es_mx: Por favor espere - consultando a la base de datos
it: Attendere, interrogazione del database
pt_br: Aguarde - consultando o banco de dados

source: Switch charts on
de: Graphiken einschalten
it: Attivare i grafici
pt_br: Ligue os gráficos
