Repository: themorlan/openREM
Catalog: docs/locales/*/LC_MESSAGES/docker_orthanc.po
Languages: de, es_mx

source: Orthanc configuration - docker-compose.yml
de: Orthanc Konfiguration - docker-compose.yml

source: The ``docker-compose.yml`` file defines all the containers that are needed for OpenREM, including the Orthanc container(s) that provide the DICOM Store functionality to enable scanners to send directly to OpenREM, and for query-retrieve to function.
de: Die Datei ``docker-compose.yml`` definiert alle Container, die für OpenREM benötigt werden, inklusive der Orthanc Container, die die DICOM Store Funktionalität beinhalten damit Geräte direkt ihre Daten an OpenREM schicken und Daten abfragen können (Query/Retrieve).

source: Unlike the ``.env.prod`` file, this file is formatted as YAML. Strings need to quoted, a ``:`` and a space separate the variable name and the value, and spaces are used at the start of the line to create a hierarchy.
de: Im Gegensatz zur ``.env.prod`` Datei, ist diese als YAML formatiert. Zeichenketten müssen in ``:`` eingeschlossen sein und ein Leerzeichen trennt Variablenname und -wert. Leerzeichen zu Beginn der Zeile definieren die Hierarchie.

source: Orthanc configuration
de: Orthanc Konfiguration

source: Edit the ``docker-compose.yml`` file to make the changes. They will take effect next time ``docker-compose`` is started.
de: Für Änderungen die Datei ``docker-compose.yml`` editieren. Diese werden beim nächsten Start von ``docker-compose`` wirksam.

source: Find the ``orthanc_1`` definition near the end of the file.
de: Der Definitionen für ``orthanc_1`` finden sich am Ende der Datei.

source: The default port for DICOM store is set to ``104``.
de: Der Standarport für die Speicherung von DICOM Objekten ist ``104``.

source: To use a different port, change both the ``ports`` section and the ``environment`` section as required. In the ports section the first number is the port exposed outside of Docker, the second number is used internally. Set them to be the same and set the environment port accordingly to enable the same port to be used within the OpenREM interface: For example, to use port 8104:
de: Um den Standard Port zu ändern, müssen die Bereiche ``ports`` und ``environment`` angepasst werden. Im Bereich ports stellt die erste Zahl den Port dar, der von Docker nach extern verwendet wird, die zweite Zahl wird intern verwendet. Verwenden Sie hier die gleichen Werte und legen Sie den environment Port entsprechend so fest wie er innerhalb der OpenREM-Schnittstelle verwendet wird: um z.B. den Port 8104 zu verwenden:

source: DICOM Application Entity Title
de: DICOM AET (Application Entity Title)

source: Application Entity Title of the Store Server. Should be up to 16 characters, no spaces. This server isn't fussy by default, so if remote nodes connect using a different AETitle that is ok.
de: AET für den Zugriff auf den DICOM Store Server. Kann bis zu 16 Zeichen enthalten, jedoch keine Leerzeichen. Dieser Server ist in der Regel gutmütig, d.h. akzeptiert auch unterschiedliche AETs.

source: Objects to be ignored
de: Objekte, die nicht beachtet werden müssen

source: Lists of things to ignore. Orthanc will ignore anything matching the content of these comma separated lists: they will not be imported into OpenREM. Some examples have been added below - note the formatting syntax:
de: Liste der nicht zu berücksichtigenten Dinge. Orthanc wird alles ignorieren, das mit dieser Komma getrennten Liste übereinstimmt: Objekte werden nicht in OpenREM importiert. Einige Beispiele sind unten aufgeführt - bitte die Syntax beachten:

source: Extractor for older Toshiba CT dose summary files
de: Extraktor für ältere Toshiba Dosisdateien

source: Enable or disable additional functionality to extract dose information from older Toshiba and GE scanners, and specify which CT scanners should use this method. Each system should be listed as ``{'Manufacturer', 'Model name'}``, with systems in a comma separated list within curly brackets, as per the example below:
de: Funktion für das extrahieren der Dosisinformation aus älteren Toshiba und GE Geräte ein- oder ausschalten und für welchen Gerätetyp dies erfolgen soll. Jedes System sollte in der Form ``{'Manufacturer', 'Model name'}`` aufgeführt werden, wie das nachstehende Beispiel zeigt:

source: Physics Filtering
de: Filterung von Phantom- (Physikalischen) Studien

source: Set this to true if you want Orthanc to keep physics test studies, and have it put them in the ``physics_to_keep_folder``. Set it to ``"false"`` to disable this feature
de: Diesen Wert auf true setzen, wenn Orthanc auch physikalische Teststudien speichern und diese im Ordner ``physics_to_keep_folder`` ablegen soll. Wird dieser Wert auf ``"false"`` gesetzt ist diese Funktion deaktiviert

source: A list to check against patient name and ID to see if the images should be kept. Orthanc will put anything that matches this in the ``physics_to_keep_folder``.
de: Eine Liste die mit Patientenname und ID abgeglichen wird um zu entscheiden ob die Bilder gespeichert werden sollen. Alles was mit dieser Liste übereinstimmt wird im Ordner ``physics_to_keep_folder`` abgelegt.

source: Orthanc web interface
de: Othanc Webschnittstelle

source: There will normally not be any studies in the Orthanc database once they have been processed, but if you want to enable the Orthanc web viewer, change ``ORTHANC__REMOTE_ACCESS_ALLOWED`` to ``"true"`` and uncomment the port declaration, changing the first number if required:
de: Normalerweise werden die Studien nicht in der Othanc Datenbank gespeichert sobald sie verarbeitet wurden. Wenn aber der Orthanc Web-Viewer verwendet werden soll, muss der Wert ``ORTHANC__REMOTE_ACCESS_ALLOWED`` auf ``"true"`` gestellt werden. Die Port-Angabe darf nicht auskommentiert sein, die erste Zahl kann bei Bedarf geändert werden:

source: Lua script path
de: Pfad für Lua Skripte

source: The path within the Orthanc container for the OpenREM Lua script is specified here - this should not be changed.
de: Der Pfad im Orthanc Container zum OpenREM Lua-Skript wird hier angegeben - dies sollte nicht geändert werden.

source: Multiple Orthanc Store nodes
de: Multiple Orthanc Speicherknoten

source: If you need more than one DICOM Store server, to listen on a different port for example, copy the whole ``orthanc_1`` section and paste it just after and before the ``volumes`` section. Rename to ``orthanc_2`` and make the port and any other changes as necessary.
de: Wird mehr als ein DICOM Store Server benötigt wird, oder ein unterschiedlicher Port verwendet werdn soll, kopieren Sie den gesamten ``orthanc_1`` Bereich und fügen dies vor dem ``volumes`` Bereich ein. Anschliessend in ``orthanc_2`` umbenennen und die entsprechenden Änderungen für den Port durchführen.

source: Next time ``docker-compose`` is started the additional Orthanc container will be started. ``docker-compose.yml`` is also used to stop the containers, so if you are removing the additional Orthanc container stop the containers first.
de: Beim nächsten Starten von ``docker-compose`` wird der zusätzliche Orthanc Container gestartet. ``docker-compose.yml`` kann auch zum anhalten der Container verwendet werden, wenn Sie also den zusätzlichen Othanc Container löschen wollen, stoppen Sie zunächst die Container.

source: Additional Orthanc configuration options
de: Zusätzliche Optionen zur Konfiguration von Orthanc

source: More configuration options can be found on the `osimis/orthanc Docker Images page <https://osimis.atlassian.net/wiki/spaces/OKB/pages/26738689/How+to+use+osimis+orthanc+Docker+images#Howtouseosimis/orthancDockerimages?-DICOM>`_
de: Zusätzliche Optionen zur Konfiguration finden sich auf der `osimis/orthanc Docker Images Seite <https://osimis.atlassian.net/wiki/spaces/OKB/pages/26738689/How+to+use+osimis+orthanc+Docker+images#Howtouseosimis/orthancDockerimages?-DICOM>`_

source: Installation
es_mx: Instalación

source: Windows or Linux: Docker install
es_mx: Windows o Linux: Instalación de Docker

source: Preparation
es_mx: Preparación

source: Install Docker
es_mx: Instalación de Docker

source: Download https://bitbucket.org/openrem/docker/get/develop.zip
es_mx: Descargar https://bitbucket.org/openrem/docker/get/develop.zip

source: Install
es_mx: Instalar

source: Extract the ZIP file and open a shell (command prompt) in the new folder
es_mx: Extraer el archivo ZIP y abrir shell (símbolo de sistema) en la nueva carpeta

source: Customise any variables in ``.env.prod`` and in the ``orthanc_1`` section in ``docker-compose.yml`` as necessary. A full description of the options are found in:
es_mx: Personalizar cualquier variable en ``.env.prod`` y en la ``orthanc_1`` sección en ``docker-compose.yml`` como sea necesario. Una descripción completa de las opciones puede ser encontrada en:

source: Start the containers with:
es_mx: Iniciar los contenedores con:

source: Get the database and translations ready:
es_mx: Tener las bases de datos y las traducciones listas:

source: Open a web browser and go to http://localhost/
es_mx: Abrir un navegador web e ir a http://localhost/

source: Non-docker alternative - Linux only
es_mx: Alternativa sin docker - Solo Linux

source: We recommend all installations to use the Docker method described above. However, it is possible to install without Docker, but only on Linux. The instructions are a prescriptive install on Ubuntu:
es_mx: Se recomienda que todas las instalaciones utilicen el método Docker como se describe mas arriba. Sin embargo, es posible realizar una instalación sin Docker, solo en Linux. Las instrucciones son una instalación prescriptiva en Ubuntu:

source: Offline Docker installations
es_mx: Instalación de Docker sin conexión

source: Upgrading an existing installation
es_mx: Actualizando una instalación existente

source: Databases
es_mx: Bases de dato

source: To be removed here, but we need some of the content in other pages, so leaving for now
es_mx: A ser removido aquí, pero necesitamos parte del contenido en otras paginas, entonces lo dejamos por ahora

source: Web servers
es_mx: Servidores Web
