Repository: themorlan/openREM
Catalog: docs/locales/*/LC_MESSAGES/env_variables.po
Languages: de, es_mx, it

source: Docker env configuration
de: Docker Umgebungskonfiguration
es_mx: Configuración del Docker env
it: Configurazione di Docker env

source: Edit the ``.env.prod`` file to customise your installation. There should be no space between the variable name, the ``=`` and the value. Everything after the ``=`` until the end of the line is transferred as the value. These settings take effect when docker-compose is started or restarted.
de: Die Datei ``.env.prod`` bearbeiten um die Installation anzupassen. Leerzeichen zwischen Variablenname, dem Zeichen ``=`` und dem Wert sind nicht erlaubt. Alles nach ``=`` bis zum Ende der Zeile wird als Wert betrachtet. Die Einstellung werden wirksam, sobald docker-compose (neu-) gestartet wird.
es_mx: Editar el archivo ``.env.prod`` para personalizar su instalación. No debe haber espacios entre el nombre de la variable, el ``=`` y el valor. Todo después de ``=`` hasta el final de la linea es transferido como el valor. Estos ajustes tienen efecto al iniciar o reiniciar el docker-compose.
it: Modifica il file ``.env.prod`` per personalizzare la tua installazione. Non dovrebbe esserci spazio tra il nome della variabile, ``=`` e il valore. Tutto ciò che segue il ``=`` fino alla fine della riga viene trasferito come valore. Queste impostazioni hanno effetto all'avvio o al riavvio di docker-compose.

source: Variables that should always be changed
de: Variablen, die auf alle Fälle angepasst werden sollten
es_mx: Variables que deberían cambiar siempre
it: Variabili che dovrebbero essere sempre modificate

source: Set a new secret key. Create your own, or generate one by using a tool like http://www.miniwebtool.com/django-secret-key-generator/ for this:
de: Wert für den geheimen Schlüssel festlgen. Entweder selbst erstellen oder über Tools wie http://www.miniwebtool.com/django-secret-key-generator/ generieren lassen:
es_mx: Introduzca una nueva llave secreta. Cree la suya, o genere una utilizando una herramienta como http://www.miniwebtool.com/django-secret-key-generator/ para esto:
it: Imposta una nuova chiave segreta. Creane uno tuo o generane uno utilizzando uno strumento come http://www.miniwebtool.com/django-secret-key-generator/ :

source: Should be a single string of hosts with a space between each. For example: ``DJANGO_ALLOWED_HOSTS=localhost 127.0.0.1 [::1] myservername``
es_mx: Debería ser una única cadena de texto de hosts con espacio entre cada uno. Por ejemplo: ``DJANGO_ALLOWED_HOSTS=localhost 127.0.0.1 [::1] myservername``

source: Variables to help with debugging problems
de: Variablen, die bei Problemen bei der Fehlersuche helfen
es_mx: Variables para ayudarnos a depurar problemas
it: Variabili per aiutare con problemi di debug

source: Set to 1 to enable Django debugging mode.
de: Auf 1 setzen um den Django Debug-Mode einzuschalten.
es_mx: Establecer en 1 para permitir el modo de depuración de Django.
it: Impostare su 1 per attivare la modalità di debug di Django.

source: Set the log level. Options are ``DEBUG``, ``INFO``, ``WARNING``, ``ERROR``, and ``CRITICAL``, with progressively less logging.
de: Den Log-Level einstellen. Optionen sind ``DEBUG``, ``INFO``, ``WARNING``, ``ERROR``, und ``CRITICAL``, mit zunehmend weniger Fehlerprotokollierung.
es_mx: Establecer el nivel de log. Las opciones son ``DEBUG``, ``INFO``, ``WARNING``, ``ERROR``, and ``CRITICAL``, con menos logs progresivamente.
it: Impostare il livello di log. Le opzioni sono ``DEBUG``, ``INFO``, ``WARNING``, ``ERROR``, e ``CRITICAL``, che hanno progressivamente meno dettaglio di log.

source: Variables to be changed for your environment
de: Variablen, die an die eigene Ümgebung angepasst werden sollten
es_mx: Variables a ser modificadas para su ambiente
it: Variabili da modificare per il vostro ambiente di lavoro

source: E-mail server settings
de: Einstellungen für den E-Mail Server
es_mx: Parámetros del servidor de E-mail
it: Impostazioni del server di posta elettronica

source: The host name and port of the e-mail server that you wish to use must be entered in the ``EMAIL_HOST`` and ``EMAIL_PORT`` fields. ``EMAIL_HOST`` might be your institution's Outlook/Exchange server.
de: Host Name und Port des verwendeten E-Mail Servers müssen in die Felder `EMAIL_HOST`` und ``EMAIL_PORT`` eingetragen werden. ``EMAIL_HOST`` kann z.B. der Outlook/Exchange Server der eigenen Institution sein.
es_mx: El nombre del host y el puerto para el servidor de e-mail que usted desee utilizar debe ser ingresado en los campos ``EMAIL_HOST`` and ``EMAIL_PORT``. El ``EMAIL_HOST`` puede ser el servidor de Outlook/Exchange de su institución.
it: Il nome host e la porta del server di posta elettronica che si desidera utilizzare devono essere inseriti nei campi ``EMAIL_HOST`` e ``EMAIL_PORT``. ``EMAIL_HOST``` potrebbe essere il server Outlook/Exchange che utilizzate normalmente.

source: If the e-mail server is set to only allow authenticated users to send messages then a suitable user and password must be entered in the ``EMAIL_HOST_USER`` and ``EMAIL_HOST_PASSWORD`` fields. If this approach is used then it may be useful to request that an e-mail account be created specifically for sending these OpenREM alert messages.
de: Geeignete Nutzer und Passwörter müssen in die Felder ``EMAIL_HOST_USER`` und ``EMAIL_HOST_PASSWORD`` eingetragen werden, wenn der E-Mail Server nur authentifizierten Nutzer erlaubt E-Mails zu senden. Bei dieser Vorgehensweise, kann es hilfreich sein, einen eigenen Account zum Versenden der OpenREM Warnmeldungen anzulegen.
es_mx: Si en los ajustes de servidor de e-mail solo se le permite usuarios autenticados a enviar mensajes se debe utilizar un usuario y contraseña adecuado que sera ingresado en los campos ``EMAIL_HOST_USER`` y ``EMAIL_HOST_PASSWORD``. Si este enfoque se utiliza entonces debería ser util el solicitar que la cuenta de e-mail sea creada específicamente para enviar estos mensajes de alerta de OpenREM.
it: Se il server di posta elettronica è impostato per consentire solo agli utenti autenticati di inviare messaggi, è necessario immettere un utente e una password adatti nei campi ``EMAIL_HOST_USER`` e ``EMAIL_HOST_PASSWORD``. Se si utilizza questo approccio, potrebbe essere utile richiedere la creazione di un account di posta elettronica specifico per l'invio di questi messaggi di avviso di OpenREM.

source: It may be possible to configure the e-mail server to allow sending of messages that originate from the OpenREM server without authentication, in which case the user and password settings should not be required.
de: Der E-Mail Server kann so konfiguriert werden, dass die Nachrichten aus OpenREM ohne Authentifizierung geschickt werden können, dann ist die Eingabe von Nutzer und Passwort nicht notwendig.
es_mx: Debería ser posible configurar el servidor de e-mail para permitir el envió de mensajes que se originen desde el servidor de OpenREM sin autenticación, en estos casos el usuario y la contraseña no serán requeridos.
it: Potrebbe essere possibile configurare il server di posta per consentire l'invio di messaggi che provengono dal server OpenREM senza autenticazione, nel qual caso le impostazioni di utente e password non dovrebbero essere necessarie.

source: The ``EMAIL_USE_TLS`` and ``EMAIL_USE_TLS`` options should be configured to match the encryption requirements of the e-mail server. Use ``0`` for False (default) and ``1`` for True.
es_mx: Las opciones ``EMAIL_USE_TLS`` y ``EMAIL_USE_SSL`` deben ser configuradas para coincidir con los requerimientos de cifrado del servidor de e-mail. Utilizando ``0`` para falso (por defecto) y ``1`` para Verdadero. Solo una de estas opciones debe ser configurada a 1.

source: The ``EMAIL_DOSE_ALERT_SENDER`` should contain the e-mail address that you want to use as the sender address.
de: Das Feld ``EMAIL_DOSE_ALERT_SENDER`` sollte die E-Mail Adresse des Absenders enthalten.
es_mx: El ``EMAIL_DOSE_ALERT_SENDER`` debería contener la dirección del e-mail que se quiere utilizar como dirección remitente.
it: ``EMAIL_DOSE_ALERT_SENDER`` dovrebbe contenere l'indirizzo e-mail che si desidera utilizzare come indirizzo del mittente.

source: The ``EMAIL_OPENREM_URL`` must contain the URL of your OpenREM installation in order for hyperlinks in the e-mail alert messages to function correctly.
de: Das Feld ``EMAIL_OPENREM_URL`` muss die URL der OpenREM Installation enthalten, damit die Weblinks in der E-Mail Benachrichtigung korrekt funktionieren.
es_mx: El ``EMAIL_OPENREM_URL`` debe contener la URL de su instalación de OpenREM para que los hipervínculos en los mensajes de alerta del e-mail funcionen correctamente.
it: ``EMAIL_OPENREM_URL`` deve contenere l'URL dell'installazione di OpenREM affinché i collegamenti ipertestuali nei messaggi di avviso e-mail funzionino correttamente.

source: Regionalisation
de: Regionalisierung
es_mx: Regionalización
it: Regionalizzazione

source: Local time zone for this installation. Choices can be found here: http://en.wikipedia.org/wiki/List_of_tz_zones_by_name although not all choices may be available on all operating systems:
de: Lokale Zeitzone dieser Installation. Werte finden sich unter : http://en.wikipedia.org/wiki/List_of_tz_zones_by_name obwohl u.U. nicht alle Auswahlmöglichkeiten auf allen Betriebssystemen verfügbar sind:
es_mx: Zona horaria local para esta instalación. Las opciones pueden ser encontradas aquí: http://en.wikipedia.org/wiki/List_of_tz_zones_by_name aunque no todas las opciones pueden estar disponibles en todos los sistemas operativos:
it: Fuso orario locale per questa installazione. Le scelte possono essere trovate qui: http://en.wikipedia.org/wiki/List_of_tz_zones_by_name anche se non tutte le scelte possono essere disponibili su tutti i sistemi operativi:

source: Language code for this installation. All choices can be found here: http://www.i18nguy.com/unicode/language-identifiers.html
de: Sprach-Code für die Installation. Mögliche Werte finden sich unter: http://www.i18nguy.com/unicode/language-identifiers.html
es_mx: Código de lenguaje para esta instalación. Todas las opciones pueden ser encontradas aquí: http://www.i18nguy.com/unicode/language-identifiers.html
it: Codice lingua per questa installazione. Tutte le scelte possono essere trovate qui: http://www.i18nguy.com/unicode/language-identifiers.html

source: If you set this to False, Django will make some optimizations so as not to load the internationalization machinery:
de: Wird dieser Wert auf Falsch gestellt, wird Django einige Optimierungen durchführen:
es_mx: Si esto se ajusta a Falso, Django realizara algunas optimizaciones para no cargar la maquinaria de internacionalización:
it: Se si imposta questo su False, Django farà alcune ottimizzazioni per non caricare il meccanismo di internazionalizzazione:

source: If you set this to False, Django will not format dates, numbers and calendars according to the current locale:
de: Wird dieser Wert auf False gesetzt, wird Django die Formate für Datum, Zahlen und Kalenderdaten nicht anhand der aktuellen Lokalisierung ändern:
es_mx: Si se establece este valor a Falso, Django no formateará fechas, números y calendarios de acuerdo con la configuración regional actual:
it: Se si imposta questo su False, Django non formatterà date, numeri e calendari in base alle impostazioni locali correnti:

source: If you set this to False (default), Django will not use timezone-aware datetimes:
de: Wird dieser Wert auf False (Standard) gesetzt, wird Django die zeitzonenbezogenen Datumsangaben nicht verwenden:
es_mx: Si establece esto en Falso (predeterminado), Django no usará fechas y horas con reconocimiento de zona horaria:
it: Se si imposta questa opzione su False (default), Django non utilizzerà gli orari di data e ora noti per il fuso orario:

source: XLSX date and time settings for exports:
de: XLSX Datum und Zeiteinstellungen für den Export:
es_mx: Configuración de fecha y hora XLSX para exportaciones:
it: Impostazioni di data e ora XLSX per le esportazioni:

source: Virtual directory settings
de: Einstellungen für den virtuellen Ordner
es_mx: Configuración del directorio virtual
it: Impostazioni della directory virtuale

source: See :doc:`virtual_directory` for details of these variables - normally these can be left commented out.
de: Für Details zu diesen Variablen siehe auch :doc:`virtual_directory` - normalerweise kann dies Angabe auskommentiert bleiben.
es_mx: Ver :doc: `virtual_directory` por detalles de estas variables - normalmente estas se pueden dejarse comentados.
it: Vedere :doc:`virtual_directory` per i dettagli di queste variabili - normalmente queste possono essere lasciate commentate.

source: Variables that should only be changed if you know what you are doing
de: Variablen, die nur geändert werden sollen, wenn Sie die Auswirkungen kennen
es_mx: Variables que solo deberían ser cambiadas si sabe lo que está haciendo
it: Variabili che dovrebbero essere modificate solo se si sa cosa si sta facendo

source: Variables that shouldn't be changed
de: Variablen die nicht geändert werden sollten
es_mx: Variables que no deben cambiarse
it: Variabili che non dovrebbero essere modificate

source: Changing this will mean some OpenREM functions will fail
de: Bei Änderungen werden einige OpenREM Funktionen fehlerhaft sein
es_mx: Cambiar esto significará que algunas funciones de OpenREM fallarán
it: La modifica di questo significherà che alcune funzioni di OpenREM non funzioneranno

source: The ``EMAIL_USE_TLS`` and ``EMAIL_USE_SSL`` options should be configured to match the encryption requirements of the e-mail server. Use ``0`` for False (default) and ``1`` for True. Only one of these options should be set to ``1``.
de: Die Optionen ``EMAIL_USE_TLS`` und ``EMAIL_USE_SSL`` sollten gemäß den Vorgaben zur Verschlüsselung auf dem E-Mail Server konfiguriert werden. Verwenden Sie eine ``0`` (Standard) wenn dies nicht zutrifft und ``1`` wenn dies Option verwendet werden soll. Nur jeweils eine der beiden Optionen sollte auf ``1`` gesetzt werden.
it: Le opzioni ``EMAIL_USE_TLS`` e ``EMAIL_USE_SSL`` dovrebbero essere configurate per soddisfare i requisiti di crittografia del server di posta elettronica. Usa ``0`` per False (predefinito) e ``1`` per True. Solo una di queste opzioni dovrebbe essere impostata su ``1``.
