Repository: themorlan/openREM
Catalog: docs/locales/*/LC_MESSAGES/install-offline.po
Languages: de, es_mx

source: Offline Docker installation
de: Docker Installation ohne Internetzugriff
es_mx: Instalación de Docker sin conexión

source: OpenREM can be run on a server that is not connected to the internet if required, though access to https://hub.docker.com would make installation and upgrades much easier.
de: OpenREM ist auf einem Server lauffähig, der nicht mit dem Internet verbunden ist. Jedoch ist die Installation und die späteren Upgrades durch den Zugriff auf https://hub.docker.com sehr viel einfacher.
es_mx: OpenREM puede correr en un servidor sin conexión a internet de ser necesario, aunque el acceso a https://hub.docker.com haría la instalación y las actualizaciones mucho mas fáciles.

source: The server will need to have Docker installed.
de: Auf den Server muss Docker installiert sein.
es_mx: El servidor necesitara tener Docker instalado.

source: Collect installation files
de: Zusammenstellung der Installationsdateien
es_mx: Recolectar archivos de instalación

source: On a computer with internet access:
de: Auf einem Computer mit Internetzugriff:
es_mx: En una computadora con acceso a internet:

source: Install Docker - this is required to download the images
de: Docker installieren - dies ist notwendig um die Software Images herunter zuladen
es_mx: Instalar Docker - esto es requerido para poder descargar las imágenes

source: Download https://bitbucket.org/openrem/docker/get/develop.zip
de: Die Datei https://bitbucket.org/openrem/docker/get/develop.zip herunterladen
es_mx: Descargar https://bitbucket.org/openrem/docker/get/develop.zip

source: Download the Docker images:
de: Folgende Docker Images herunterladen:
es_mx: Descargar las imágenes de Docker:

source: Now save them as tar files:
de: Als tar-Dateien speichern:
es_mx: Ahora guardarlas como archivos tar:

source: If both the computer with internet access and the target server are Linux or MacOS the images can be made smaller using gzip, for example:
de: Wenn sowohl der Computer mit Internetzugriff als auch der Ziel-Server mit Linux oder MacOS laufen, können die Images mittels gzip verkleinert werden, z.B.:
es_mx: Si tanto la computadora con acceso a internet como la destinada para server son Linux o MacOS las imágenes se pueden comprimir mas utilizando gzip, por ejemplo:

source: Copy all the tar files and the zip file to the server where OpenREM is to be installed.
de: Alle tar Dateien und die zip Dateo auf den Server kopieren auf dem OpenREM installiert werden soll.
es_mx: Copiar todos los archivos tar y los zip al servidor donde sera instalado OpenREM.

source: Load the docker images
de: Die Docker Images laden
es_mx: Cargar las imágenes Docker

source: On the server where OpenREM is to be installed, in the folder containing the Docker images:
de: Auf dem Server, auf dem OpenREM installiert werden soll, den Ordner mit den Docker Images:
es_mx: En el servidor donde se instalara OpenREM, en la carpeta que contiene las imágenes Docker:

source: If you have compressed the images with gzip the command is the same but with the ``.gz`` suffix, for example:
de: Wenn die Images mit gzip komprimiert wurden, ist der Befehl identisch, lediglich mit einem ``.gz`` Suffix, z.B.:
es_mx: Si se comprimieron las imágenes con gzip el comando es el mismo pero con el sufijo ``.gz``, por ejemplo:

source: Check that the images have been loaded:
de: Überprüfen ob die folgenden Images geladen sind:
es_mx: Comprobar que las imágenes han sido cargadas:

source: Continue to :ref:`dockerinstall`
de: Weiter mit :ref:`dockerinstall`
es_mx: Continuar a :ref:`dockerinstall`
