Repository: themorlan/openREM
Catalog: docs/locales/*/LC_MESSAGES/installation.po
Languages: de, it, nb_no

source: Windows or Linux: Docker install
de: Windows oder Linux: Docker Installation
it: Windows o Linux: installazione Docker
nb_no: Windows eller Linux: Docker-installasjon

source: Preparation
de: Vorbereitung
it: Preparazione
nb_no: Forberedelse

source: Install Docker
de: Docker installieren
it: Installare Docker
nb_no: Installer Docker

source: Download https://bitbucket.org/openrem/docker/get/develop.zip
de: Die Datei https://bitbucket.org/openrem/docker/get/develop.zip herunterladen
nb_no: Last ned https://bitbucket.org/openrem/docker/get/develop.zip

source: Install
de: Installieren
it: Installare
nb_no: Installer

source: Extract the ZIP file and open a shell (command prompt) in the new folder
de: Die ZIP Datei entpacken und eine neue Shell (Eingabeaufforderung) in einem neuen Ordner öffnen
it: Estrai il file ZIP e apri una shell (prompt dei comandi) nella nuova cartella

source: Customise any variables in ``.env.prod`` and in the ``orthanc_1`` section in ``docker-compose.yml`` as necessary. A full description of the options are found in:
de: Variablen in ``.env.prod`` und im ``orthanc_1`` Abschnitt von ``docker-compose.yml`` entsprechend anpassen. Eine komplette Beschreibung der Optionen findet sich unter:
it: Personalizza le variabili in ``.env.prod`` e nella sezione ``orthanc_1`` in ``docker-compose.yml`` come necessario. Una descrizione completa delle opzioni si trova in:
nb_no: Tilpass variabler i ``.env.prod`` og i ``orthanc_1``-delen i ``docker-compose.yml`` etter behov. En full beskrivelse av innstillingene er å finne i:

source: Start the containers with:
de: Die Container starten mit:
it: Avviare i container con:
nb_no: Start beholderne med:

source: Get the database and translations ready:
de: Die Datenbank und die Übersetzungen einrichten:
it: Prepara il database e le traduzioni:
nb_no: Klargjør databasen og oversettelsene:

source: Open a web browser and go to http://localhost/
de: Einen Internetbrowser öffnen und http://localhost/ aufrufen
it: Apri un browser web e vai su http://localhost/
nb_no: Åpne en nettleser og gå til http://localhost/

source: Non-docker alternative - Linux only
de: Alternative ohne Docker - nur unter Linux

source: We recommend all installations to use the Docker method described above. However, it is possible to install without Docker, but only on Linux. The instructions are a prescriptive install on Ubuntu:
de: Wir empfehlen, wie oben beschrieben, die Installation über Docker. Es ist zwar eine Installation ohne Docker möglich, jedoch nur für Linux. Die Anleitungen beziehen sich auf eine Installation unter Ubuntu:
it: Si consiglia per tutte le installazioni di utilizzare il metodo Docker descritto sopra. Tuttavia, Ã¨ possibile installare senza Docker, ma solo su Linux. Le istruzioni si riferiscono ad un'installazione standard su Ubuntu:

source: Offline Docker installations
de: Docker Installation ohne Internetzugriff (Offline)
it: Installazioni Docker offline
nb_no: Frakoblede Docker-installasjoner

source: Upgrading an existing installation
de: Upgrade einer bestehenden Installation
it: Aggiornamento di un'installazione esistente
nb_no: Oppgradering av eksisterende installasjon

source: Databases
de: Datenbanken
it: Database
nb_no: Databaser

source: To be removed here, but we need some of the content in other pages, so leaving for now
de: Kann hier gelöscht werden, wir benötigen Teile des Inhaltes aber auf anderen Seiten, deshalb bleibt das erstmal
it: Deve essere rimosso , ma abbiamo bisogno di alcuni contenuti in altre pagine, quindi per ora lasciamo
nb_no: Fjernes herfra, men noe av innholdet trengs i andre sider, så levner foreløpig

source: Web servers
de: Webserver
it: Server Web
nb_no: Vev-tjenere

source: Installation
it: Installazione
nb_no: Installasjon

source: Non-Docker alternative - Linux only
it: Alternativa non Docker: solo Linux
