Repository: themorlan/openREM
Catalog: docs/locales/*/LC_MESSAGES/quick_start_linux.po
Languages: de, es_mx

source: One page complete Ubuntu install
de: Komplette Ubuntu Installation auf einer Seite
es_mx: Una página completa instalación de Ubuntu

source: This setup is no longer recommended - the Docker :doc:`installation` method is instead. If a non-Docker installation is required then this guide can be followed.
de: Diese Installationsart wird nicht mehr empfohlen - stattdessen sollte die Docker :doc:`installation` Methode gewählt werden. Für eine non-Docker Installation kann dieser Anleitung gefolgt werden.
es_mx: Esta configuración ya no se recomienda, sino el método Docker: doc: ʻinstallation`. Si se requiere una instalación que no sea con Docker, se puede seguir esta guía.

source: This install is based on Ubuntu 18.04 using:
de: Diese Installation basiert auf Ubuntu 18.04:
es_mx: Esta instalación es basada en Ubuntu 18.04 usando:

source: Python 3.8 running in a virtualenv
de: Python 3.8 in einem virtualenv
es_mx: Python 3.8 ejecutándose en un ambiente virtual

source: Database: PostgreSQL
de: Datenbank: PostgreSQL
es_mx: Base de datos: PostgreSQL

source: DICOM Store SCP: Orthanc running on port 104
de: DICOM Store SCP: Orthanc mit Port 104
es_mx: Almacenaje DICOM SCP: Orthanc ejecutándose en el puerto 104

source: Webserver: NGINX with Gunicorn
de: Webserver: NGINX mit Gunicorn
es_mx: Servidor Web: NGINX con Gunicorn

source: Daemonisation: systemd scripts for Celery and Gunicorn
de: Dämonisierung: systemd Skripte für Celery und Gunicorn
es_mx: Daemonización: systemd scripts para Celery y Gunicorn

source: All OpenREM files in ``/var/dose/`` with group owner of ``openrem``
de: Alle OpenREM Dateien in ``/var/dose/`` mit Gruppe ``openrem``
es_mx: Todos los archivos de OpenREM en ``/var/dose/`` con propiedad de grupo de ``openrem``

source: Collects any Physics (QA) images and zips them
de: Sammelt alle QA (physikalische) Bilder und packt sie als ZIP
es_mx: Recopila cualquier imagen realizada por Físicos (QA) y las comprime

source: The instructions should work for Ubuntu 20.04 too, references to bionic will be focal instead.
de: Diese Anleitung sollte auch unter Ubuntu 20.04 funktionieren, Verweise auf bionic werden stattdessen focal sein.
es_mx: Las instrucciones también deberían funcionar para Ubuntu 20.04, las referencias a bionic serán focales en su lugar.

source: Initial prep
de: Initiale Vorbereitung
es_mx: Preparación inicial

source: First edit ``/etc/hosts`` to add the local server name -- else ``rabbitmq-server`` will not start when installed:
de: In der ``/etc/hosts`` Datei zuerst den lokalen Servernamen eintragen - ansonsten startet ``rabbitmq-server`` nach der Installation nicht:
es_mx: Primero edite `` / etc / hosts`` para agregar el nombre del servidor local; de lo contrario, `` rabbitmq-server``no se iniciará cuando se instale:

source: Modify the content to ensure the following two lines are present -- **substitute the correct server hostname on the second line**::
de: Den Inhalt so modifizieren, so dass die folgenden zwei Zeilen vorhanden sind -- **ersetzen Sie den korrekten Server Hostnamen in der zweiten Zeile**::
es_mx: Modifique el contenido para asegurarse de que las siguientes dos líneas estén presentes -- **sustituya el nombre de host del servidor correcto en la segunda línea**::

source: ``Ctrl-o`` (write-[o]ut), ``Return`` to accept, then ``Ctrl-x`` to e[x]it
de: ``Ctrl-o`` (speichern = write [o]ut), ``Return`` zum Bestätigen, dann ``Ctrl-x`` für Ende = e[x]it
es_mx: ``Ctrl-o`` (escriba-[o]ut), ``Return`` para aceptar, luego ``Ctrl-x`` para e[x]it

source: **Apt sources**
es_mx: ** Fuentes apt **

source: We will need the ``universe`` repository enabled. Check first:
de: Das ``universe`` Repository muss freigegeben sein. Zuerst überprüfen:
es_mx: Necesitaremos que el repositorio ``universe`` esté habilitado. Verifique primero:

source: Look for::
de: Suchen nach::
es_mx: Buscar::

source: If these two lines are not there, add them in (``sudo nano /etc/apt/sources.list``).
de: Wenn die beiden Zeilen nicht vorhanden sind, dann über (``sudo nano /etc/apt/sources.list``) hinzufügen.
es_mx: Si estas dos líneas no están allí, agréguelas en (`` sudo nano / etc / apt / sources.list``).

source: **Groups**
es_mx: **Grupos**

source: Now create new group ``openrem`` and add your user to it (``$USER`` will automatically substitute for the user you are running as) :
de: Eine neue Gruppe ``openrem`` erstellen und den eigenen Nutzer dieser Gruppe hinzufügen (``$USER`` wird automatisch für den aktuellen Nutzer hinzugefügt) :
es_mx: Ahora cree un nuevo grupo ``openrem`` y agregue su usuario al mismo (``$USER`` sustituirá automáticamente al usuario con el que está ejecutando):

source: At a later stage, to add a second administrator just add them to the ``openrem`` group in the same way.
de: Zu einem späteren Zeitpunkt kann ein zweiter Administrator der ``openrem`` Gruppe auf die gleiche Weise hinzugefügt werden.
es_mx: En una etapa posterior, para agregar un segundo administrador, simplemente agréguelo al grupo ``openrem`` de la misma manera.

source: **Folders**
de: **Ordner**
es_mx: **Carpetas**

source: Create the folders we need, and set the permissions. In due course, the ``orthanc`` user and the ``www-data`` user will be added to the ``openrem`` group, and the 'sticky' group setting below will enable both users to write to the logs etc:
de: Die benötigten Ordner erzeugen und die Zugriffrechte setzen. Zu gegebener Zeit wird der ``orthanc`` Nutzer und der ``www-data`` Nutzer der ``openrem`` Gruppe hinzugefügt und die 'sticky' Gruppeneinstellungen werden für beide Nutzer freigegeben, damit diese Log-Dateien etc. schreiben dürfen:
es_mx: Cree las carpetas que necesitemos y establezca los permisos. A su debido tiempo, el usuario ``orthanc`` y el usuario ``www-data`` se agregarán al grupo ``openrem``, y la configuración del grupo 'sticky' a continuación permitirá a ambos usuarios escribir en los registros etc:

source: Install apt packages and direct downloads
de: APT-Pakete und direkte Downloads installieren
es_mx: Instalar paquetes apt y descargas directas

source: Create the virtualenv
de: Die virtualenv erzeugen
es_mx: Crear el virtualenv

source: Create a virtualenv (Python local environment) in the folder we created:
de: Eine virtualenv in dem erstellten Ordner erzeugen (lokale Python Umgebung):
es_mx: Cree un virtualenv (entorno local de Python) en la carpeta que creamos:

source: Activate the virtualenv
de: Die virtualenv aktivieren
es_mx: Activar el virtualenv

source: Activate the virtualenv (note the ``.`` -- you can also use the word ``source``):
de: Die virtualenv aktivieren (den ``.`` beachten -- oder das Wort ``source``verwenden):
es_mx: Active el virtualenv (tenga en cuenta el ``.`` -- también puede usar la palabra ``source``):

source: Install Python packages
de: Installation der Python Pakete
es_mx: Instalar paquetes Python

source: Add orthanc and www-data users to openrem group
de: orthanc und www-data Nutzer der Gruppe openrem hinzufügen
es_mx: Agregar a los usuarios orthanc y a www-data al grupo openrem

source: Database and OpenREM config
de: Konfiguration von Datenbank und OpenREM
es_mx: Configuración de la base de datos y OpenREM

source: Setup PostgreSQL database
de: PostgreSQL Datenbank einrichten
es_mx: Configurar la base de datos PostgreSQL

source: Create a postgres user, and create the database. You will be asked to enter a new password (twice). This will be needed when configuring OpenREM:
de: Einen postgres Nutzer anlegen, die Datenbank anlegen. Die Passwort-Abfrage erfolgt zweimal. Für die Konfiguration von OpenREM wird folgendes benötigt:
es_mx: Cree un usuario de postgres y cree la base de datos. Se le pedirá que ingrese una nueva contraseña (dos veces). Esto será necesario al configurar OpenREM:

source: If you are migrating from another server, you could at this point create a template0 database to restore into. See :ref:`restore-psql-linux` for details.
de: Bei Migration von einem anderen Server kann hier eine template0 Datenbank für die Wiederherstellung angelegt werden. Mehr dazu unter :ref:`restore-psql-linux`.
es_mx: Si está migrando desde otro servidor, podría en este punto crear una base de datos template0 para restaurar. Consulte :ref:`restore-psql-linux` para obtener más detalles.

source: Update the PostgreSQL client authentication configuration. Add the following line anywhere near the bottom of the file, for example in the gap before ``# DO NOT DISABLE`` or anywhere in the table that follows. The number of spaces between each word is not important (one or more).
de: Update der Konfiguration für die PostgreSQL Client Authentifizierung. Folgende Zeile am Ende der Datei hinzufügen, z.B, in der Lücke vor ``# DO NOT DISABLE`` oder woanders in der folgenden Tabelle. Die Anzahl der Leerzeichen zwischen jdem Wort ist nicht relevant (eins oder mehrere).
es_mx: Actualice la configuración de autenticación del cliente de PostgreSQL. Agregue la siguiente línea en cualquier lugar cerca de la parte inferior del archivo, por ejemplo, en el espacio antes de ``# DO NOT DISABLE`` o en cualquier parte de la tabla que sigue. El número de espacios entre cada palabra no es importante (uno o más).

source: Reload postgres:
de: postgres neu laden:
es_mx: Recargar postgres:

source: Configure OpenREM
de: OpenREM konfigurieren
es_mx: Configurar OpenREM

source: First navigate to the Python openrem folder and copy the example local_settings and wsgi files to remove the ``.example`` suffixes:
de: Zunächst in den Python openrem Ordner wechseln und die example local_settings aund wsgi Dateien kopieren um den ``.example`` Suffix zu entfernen:
es_mx: Primero navegue a la carpeta de Python openrem y copie los archivos de ejemplo local_settings y wsgi para eliminar los sufijos ``.example``:

source: Edit the new local_settings file
de: Die neue local_settings Datei editieren
es_mx: Edite el nuevo archivo local_settings

source: Now create the database. Make sure you are still in the openrem python folder and the virtualenv is active — prompt will look like
de: Jetzt die Datenbank erzeugen. Stellen Sie sicher, dass Sie sich noch im openrem python Ordner befinden und das virtualenv aktiv ist -- die Eingabeaufforderung sieht wie folgt aus
es_mx: Ahora crea la base de datos. Asegúrese de estar todavía en la carpeta openrem python y que virtualenv esté activo — el indicador se verá así

source: Otherwise see :ref:`activatevirtualenv` and navigate back to that folder:
de: Ansonsten unter ﻿:ref:`activatevirtualenv` nachschauen und in folgenden Ordner zurückwechseln:
es_mx: De lo contrario consulte :ref:`activatevirtualenv` y navegue de regreso a esa carpeta:

source: Generate translation binary files
de: Die Binärdateien der Übersetzung erzeugen
es_mx: Generar archivos binarios de traducción

source: Webserver
es_mx: Servidor Web

source: Configure NGINX and Gunicorn
de: NGINX und Gunicorn konfigurieren
es_mx: Configurar NGINX y Gunicorn

source: Create the OpenREM site config file
de: Die Konfigurationsdatei für die OpenREM Seite erzeugen
es_mx: Cree el archivo de configuración del sitio OpenREM

source: Remove the default config and make ours active:
de: Die Defaulteinstellungen löschen und die eigenen aktivieren:
es_mx: Eliminemos la configuración predeterminada y activemos la nuestra:

source: Add the static files to the static folder for NGINX to serve. Again, you need to ensure the virtualenv is active in your console and you are in the ``site-packages/openrem/`` folder:
de: Die statischen Dateien in den statischen Ordner für NGINX hinzufügen. In der Konsole überprüfen ob virtualenv aktiv ist und ob Sie sich im ``site-packages/openrem/`` Ordner befinden:
es_mx: Agregue los archivos static a la carpeta static para que NGINX los sirva. Nuevamente, debe asegurarse de que virtualenv esté activo en su consola y que se encuentre en la carpeta ``site-packages/openrem/``:

source: Create the Gunicorn systemd service file:
de: Die systemd Service Datei für Gunicorn erzeugen:
es_mx: Cree el archivo de servicio systemd de Gunicorn:

source: Load the new systemd configurations:
de: Die neue systemd Konfiguration laden:
es_mx: Cargue las nuevas configuraciones de systemd:

source: Set the new Gunicorn service to start on boot:
de: Den neuen Gunicorn Dienst bei Booten starten:
es_mx: Configure el nuevo servicio Gunicorn para que se inicie al arrancar:

source: Start the Gunicorn service, and restart the NGINX service:
de: Den Gunicorn Dienst starten und den NGINX Dienst neu starten:
es_mx: Inicie el servicio Gunicorn y reinicie el servicio NGINX:

source: Test the webserver
de: Den Webserver testen
es_mx: Pruebe el servidor web

source: You should now be able to browse to the OpenREM server from another PC.
de: Jetzt sollte der Zugriff auf den OpenREM Server von anderen Rechner möglich sein.
es_mx: Ahora debería poder navegar hasta el servidor OpenREM desde otra PC.

source: You can check that NGINX and Gunicorn are running with the following two commands:
de: Ob NGINX und Gunicorn bereit sind kann mit den folgenden zwei Befehlen überprüft werden:
es_mx: Puede verificar que NGINX y Gunicorn se estén ejecutando con los siguientes dos comandos:

source: Celery and Flower
de: Celery und Flower
es_mx: Celery y Flower

source: First, create a Celery configuration file:
de: Zuerst eine Celery Konfigurationsdatei anlegen:
es_mx: Primero, cree un archivo de configuración de Celery:

source: Now create the systemd service files:
de: Jetzt die systemd-Dienst Datei anlegen:
es_mx: Ahora cree los archivos de servicio systemd:

source: Now register, set to start on boot, and start the services:
de: Jetzt die Dienste registrieren, beim Booten als automatisch startend festlegen und alle Dienste starten:
es_mx: Ahora regístrese, configure para comenzar en el arranque e inicie los servicios:

source: DICOM Store SCP
es_mx: Almacenaje DICOM SCP

source: Open the following link in a new tab and copy the content (select all then Ctrl-c): |openrem_orthanc_conf_link|
de: Den nachfolgenden Link in einem neuen Tab öffnen und den Inhalt kopieren (alles auswählen dann Ctrl-C): |openrem_orthanc_conf_link|
es_mx: Abra el siguiente enlace en una nueva pestaña y copie el contenido (seleccione todo y luego Ctrl-c): | openrem_orthanc_conf_link|

source: Create the lua file to control how we process the incoming DICOM objects and paste the content in (Shift-Ctrl-v if working directly in the Ubuntu terminal, something else if you are using PuTTY etc):
de: Die lua Datei erstellen mit der die Verarbeitung für eintreffende DICOM Objekte festgelegt wird und den Inhalt einfügen (Shift-Ctrl-v wenn Sie sich direkt in einem Ubuntu Terminalfenster befinden, bzw. auf andere Art und Weise, wenn Sie PuTTY etc verwenden):
es_mx: Cree el archivo lua para controlar cómo procesamos los objetos DICOM entrantes y pegue el contenido en (Shift-Ctrl-v si trabaja directamente en la terminal de Ubuntu, algo más si está usando PuTTY, etc.):

source: Then edit the top section as follows -- keeping Physics test images has been configured, set to false to change this. There are other settings too that you might like to change in the second section (not displayed here):
de: Den oberste Abschnitt wie folgt ändern -- die physikalischen Testbilder werden standardmäßig gespeichert, auf false setzen um dies zu ändern. Im zweiten Abschnitt können weitere Einstellungen geändert werden (hier nicht dargestellt):
es_mx: Luego edite la sección superior de la siguiente manera: se ha configurado mantener las imágenes de prueba de física, establezca en falso para cambiar esto. También hay otras configuraciones que le gustaría cambiar en la segunda sección (no se muestra aquí):

source: Add the Lua script to the Orthanc config:
de: Dieses Lua Skript zur Othanc Konfiguration hinzufügen:
es_mx: Agregue el script Lua a la configuración de Orthanc:

source: Optionally, you may also like to enable the HTTP server interface for Orthanc (although if the Lua script is removing all the objects as soon as they are processed, you won't see much!):
de: Optional kann die HTTP Server Schnittstelle für Orthanc aktiviert werden (sollte das Lua Skriot alle Objekte nach der Verarbeiten löschen, werden Sie davon allerdings nicht viel sehen!):
es_mx: Opcionalmente, también puede habilitar la interfaz del servidor HTTP para Orthanc (aunque si el script Lua está eliminando todos los objetos tan pronto como se procesan, ¡no verá mucho!):

source: To see the Orthanc web interface, go to http://openremserver:8042/ -- of course change the server name to that of your server!
de: Der Aufruf der Orthanc Web Schnittstelle erfolgt über http://openremserver:8042/ -- der Servername muss dafür an den eigenen Server angepasst werden!
es_mx: Para ver la interfaz web de Orthanc, vaya a http://openremserver:8042/ -- ¡por supuesto, cambie el nombre del servidor por el de su servidor!

source: Allow Orthanc to use DICOM port
de: Orthanc erlauben den DICOM Port zu verwenden
es_mx: Permitir que Orthanc use el puerto DICOM

source: By default, Orthanc uses port 4242. If you wish to use a lower port, specifically the DICOM port of 104, you will need to give the Orthanc binary special permission to do so:
es_mx: De forma predeterminada, Orthanc usa el puerto 4242. Si desea usar un puerto inferior, específicamente el puerto DICOM 104, deberá otorgarle al binario Orthanc un permiso especial para hacerlo:

source: Then edit the Orthanc configuration again:
de: Die Orthanc Konfiguration erneut bearbeiten:
es_mx: Luego edite la configuración de Orthanc nuevamente:

source: Finish off
de: Fertigstellen
es_mx: Terminar

source: Restart Orthanc:
de: Orthanc neu starten:
es_mx: Reiniciar Orthanc:

source: New users, and quick access to physics folder
de: Neue Nutzer, und schneller Zugriff auf den Physik-Ordner
es_mx: Nuevos usuarios y acceso rápido a la carpeta de físicos

source: This is for new Linux users; for new OpenREM users, refer to :ref:`user-settings`
de: Das ist für Linux Nutzer neu; neue OpenREM Nutzer bitte unter :ref:`user-settings` nachsehen
es_mx: Esto es para nuevos usuarios de Linux; para nuevos usuarios de OpenREM, consulte :ref:`user-settings`

source: If you left ``local use_physics_filtering = true`` in the Orthanc configuration, you might like to give your colleagues a quick method of accessing the physics folder from their home folder. Then if they use a program like `WinSCP`_ it is easy to find and copy the QA images to another (Windows) computer on the network. WinSCP can also be run directly from a USB stick if you are unable to install software :-)
de: War in der Orthanc Konfiguration ``local use_physics_filtering = true`` gesetzt, kann den Kollegen eine schnelle Methode für den Zugriff auf den Physik-Ordner eingerichtet werden. Wird ein Programm wie `WinSCP`_ verwendet ist es einfach die QA Bilder zu finden und auf einen anderen (Windows) Rechner im Netzwerk zu kopieren. WinSCP kann auch direkt von einem USB-Stick aufgerufen werden, wenn die Software nicht installiert werden kann :-)
es_mx: Si dejó ``local use_physics_filtering = true`` en la configuración de Orthanc, es posible que desee darles a sus colegas un método rápido para acceder a la carpeta física desde su carpeta de inicio. Entonces, si usan un programa como `WinSCP`_ es fácil encontrar y copiar las imágenes de control de calidad a otra computadora (Windows) en la red. WinSCP también se puede ejecutar directamente desde una memoria USB si no puede instalar el software :-)

source: Add the new user (replace ``newusername`` as appropriate):
es_mx: Agregue el nuevo usuario (reemplace ``newusername`` según corresponda):

source: Then add the new user to the `openrem` group (again, replace the user name):
de: Den neuen Nutzer der `openrem` Gruppe hinzufügen (den Nutzernamen wieder entsprechend anpassen):
es_mx: Luego agregue el nuevo usuario al grupo `openrem` (nuevamente, reemplace el nombre de usuario):

source: Now add a 'sym-link' to the new users home directory (again, replace the user name):
de: Jetzt einen 'sym-link' auf das Home-Verzeichnis des neuen Nutzers hinzufügen (den Nutzernamen wieder entsprechend ersetzen):
es_mx: Ahora agregue un 'sym-link' al directorio de inicio de los nuevos usuarios (nuevamente, reemplace el nombre de usuario):

source: The new user should now be able to get to the physics folder by clicking on the ``physicsimages`` link when they log in, and should be able to browse, copy and delete the zip files and folders.
de: Der neue Nutzer sollte, sobald er eingeloggt ist, jetzt durch Klicken auf ``physicsimages`` Link auf den Physik-Ordner zugreifen können, die ZIP Dateien und Ordner anzeigen, kopieren und löschen können.
es_mx: El nuevo usuario ahora debería poder acceder a la carpeta física haciendo clic en el enlace ``physicsimages`` cuando inicie sesión, y debería poder navegar, copiar y eliminar los archivos y carpetas zip.

source: Enable RadbbitMQ queue management interface
de: Die RabbittMQ Management Queue aktivieren
es_mx: Habilitar la interfaz de administración de colas de RabbitMQ

source: **Optional -- RabbitMQ Administrator**
es_mx: **Opcional: administrador de RabbitMQ**

source: This is not required unless you wish to interact with the RabbitMQ management interface directly. Most functions can be carried out in the OpenREM interface instead. If you do wish to create a user for this purpose, see the general instructions to :ref:`enableRabbitMQ`.
de: Dies wird nicht benötigt, es sei denn Sie wollen direkt mit der RabbitMQ Management Schnittstelle interagieren. Die meisten Funktionen können stattdessen direkt über die OpenREM Schnittstelle ausgeführt werden. Soll ein eigener Nutzer für diesen Zweck angelegt werden, lesen Sie die allgemeinen Hinweise unter :ref:`enableRabbitMQ`.
es_mx: Esto no es necesario a menos que desee interactuar directamente con la interfaz de administración de RabbitMQ. La mayoría de las funciones se pueden realizar en la interfaz de OpenREM. Si desea crear un usuario para este propósito, consulte las instrucciones generales para :ref:`enableRabbitMQ`.

source: Log locations
de: Ort der Log-Dateien
es_mx: Ubicaciones de registros

source: **Host file**
de: **Host Datei**
